JoseMorenoJ/csp_payload_msp430/payload/drivers/dbg_print/src/dbg_print.c
/*
 * myserial.c
 *
 * Taken and adjusted from https://github.com/EMCLab-Sinica/Intermittent-OS
 *
 */
#include <stdio.h>
#include <stdarg.h>

#include "dbg_print.h"
#include "driverlib.h"

// The following structure will configure the EUSCI_A port to run at 9600 baud from an 1~16MHz ACLK
// The baud rate values were calculated at: http://software-dl.ti.com/msp430/msp430_public_sw/mcu/msp430/MSP430BaudRateConverter/index.html
EUSCI_A_UART_initParam UartParams[8] = {
    {// 1MHz
     EUSCI_A_UART_CLOCKSOURCE_SMCLK,
     6,  // clockPrescalar
     8,  // firstModReg
     17, // secondModReg
     EUSCI_A_UART_NO_PARITY,
     EUSCI_A_UART_LSB_FIRST,
     EUSCI_A_UART_ONE_STOP_BIT,
     EUSCI_A_UART_MODE,
     EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION},
    {// 2.66MHz
     EUSCI_A_UART_CLOCKSOURCE_SMCLK,
     17, // clockPrescalar
     5,  // firstModReg
     2,  // secondModReg
     EUSCI_A_UART_NO_PARITY,
     EUSCI_A_UART_LSB_FIRST,
     EUSCI_A_UART_ONE_STOP_BIT,
     EUSCI_A_UART_MODE,
     EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION},
    {// 3.5MHz
     EUSCI_A_UART_CLOCKSOURCE_SMCLK,
     22,  // clockPrescalar
     12,  // firstModReg
     107, // secondModReg
     EUSCI_A_UART_NO_PARITY,
     EUSCI_A_UART_LSB_FIRST,
     EUSCI_A_UART_ONE_STOP_BIT,
     EUSCI_A_UART_MODE,
     EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION},
    {// 4MHz
     EUSCI_A_UART_CLOCKSOURCE_SMCLK,
     26,  // clockPrescalar
     0,   // firstModReg
     214, // secondModReg
     EUSCI_A_UART_NO_PARITY,
     EUSCI_A_UART_LSB_FIRST,
     EUSCI_A_UART_ONE_STOP_BIT,
     EUSCI_A_UART_MODE,
     EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION},
    {// 5.33MHz
     EUSCI_A_UART_CLOCKSOURCE_SMCLK,
     34, // clockPrescalar
     11, // firstModReg
     17, // secondModReg
     EUSCI_A_UART_NO_PARITY,
     EUSCI_A_UART_LSB_FIRST,
     EUSCI_A_UART_ONE_STOP_BIT,
     EUSCI_A_UART_MODE,
     EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION},
    {// 7MHz
     EUSCI_A_UART_CLOCKSOURCE_SMCLK,
     45, // clockPrescalar
     9,  // firstModReg
     17, // secondModReg
     EUSCI_A_UART_NO_PARITY,
     EUSCI_A_UART_LSB_FIRST,
     EUSCI_A_UART_ONE_STOP_BIT,
     EUSCI_A_UART_MODE,
     EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION},
    {// 8MHz
     EUSCI_A_UART_CLOCKSOURCE_SMCLK,
     52, // clockPrescalar
     1,  // firstModReg
     73, // secondModReg
     EUSCI_A_UART_NO_PARITY,
     EUSCI_A_UART_LSB_FIRST,
     EUSCI_A_UART_ONE_STOP_BIT,
     EUSCI_A_UART_MODE,
     EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION},
    {// 16MHz
     EUSCI_A_UART_CLOCKSOURCE_SMCLK,
     104, // clockPrescalar
     2,   // firstModReg
     182, // secondModReg
     EUSCI_A_UART_NO_PARITY,
     EUSCI_A_UART_LSB_FIRST,
     EUSCI_A_UART_ONE_STOP_BIT,
     EUSCI_A_UART_MODE,
     EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION}};

static uint8_t get_clock_setting()
{
    uint32_t clock_fq = CS_getACLK();
    // clock frequency shall be one of the valid values defined in cs.c as CS_DCO_FREQ_x
    switch (clock_fq)
    {
    case 1000000:
        return 0;
    case 2670000:
        return 1;
    case 3330000:
        return 2;
    case 4000000:
        return 3;
    case 5330000:
        return 4;
    case 6670000:
        return 5;
    case 8000000:
        return 6;
    case 16000000:
        return 7;
    default:
        return 0;
    }
}

void print2uart(char *format, ...)
{
    char *traverse;
    int i;
    unsigned long l;
    char *s;

    // Module 1: Initializing Myprintf's arguments
    va_list arg;
    va_start(arg, format);

    for (traverse = format; *traverse != '\0'; traverse++)
    {
        while (*traverse != '%' && *traverse != '\0')
        {
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, (uint8_t)*traverse);
            traverse++;
        }

        if (*traverse == '\0')
            break;

        traverse++;

        // Module 2: Fetching and executing arguments
        switch (*traverse)
        {
        case 'c':
            i = va_arg(arg, int); // Fetch char argument
            EUSCI_A_UART_transmitData(EUSCI_A0_BASE, (uint8_t)i);
            break;
        case 'l':
            l = va_arg(arg, unsigned long); // Fetch Decimal/Integer argument
            print2uart(convertl(l, 10));
            break;
        case 'd':
            i = va_arg(arg, int); // Fetch Decimal/Integer argument
            if (i < 0)
            {
                i = -i;
                EUSCI_A_UART_transmitData(EUSCI_A0_BASE, (uint8_t)'-');
            }
            print2uart(convert(i, 10));
            break;
        case 's':
            s = va_arg(arg, char *); // Fetch string
            print2uart(s);
            break;
        case 'x':
            i = va_arg(arg, unsigned int); // Fetch Hexadecimal representation
            print2uart(convert(i, 16));
            break;
        }
    }
    // Module 3: Closing argument list to necessary clean-up
    va_end(arg);
}

void print2uartc(char c)
{
    EUSCI_A_UART_transmitData(EUSCI_A0_BASE, (uint8_t)c);
}

void dummyprint(char *format, ...)
{
    return;
}

void print2uartlength(char *str, int length)
{
    int i;

    for (i = 0; i < length; i++)
    {
        EUSCI_A_UART_transmitData(EUSCI_A0_BASE, (uint8_t) * (str + i));
    }
}

char *convert(unsigned int num, int base)
{
    static char Representation[] = "0123456789ABCDEF";
    static char buffer[50];
    char *ptr;

    ptr = &buffer[49];
    *ptr = '\0';

    do
    {
        *--ptr = Representation[num % base];
        num /= base;
    } while (num != 0);

    return (ptr);
}

char *convertl(unsigned long num, int base)
{
    static char Representation[] = "0123456789ABCDEF";
    static char buffer[50];
    char *ptr;

    ptr = &buffer[49];
    *ptr = '\0';

    do
    {
        *--ptr = Representation[num % base];
        num /= base;
    } while (num != 0);

    return (ptr);
}

/*
 * A0 as the debug UART in pins P2.0 and P2.1
 *
 * This is, EUSCI_A0_BASE and secondary module function for both
 *  pins P2.0 (UCA0TXD) and P2.1 (UCA0RXD)
 */
void dbg_print_uart_init(void)
{
    // Configure P2.0 - UCA0TXD and P2.1 - UCA0RXD
    GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P2, GPIO_PIN0, GPIO_SECONDARY_MODULE_FUNCTION);
    GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P2, GPIO_PIN1, GPIO_SECONDARY_MODULE_FUNCTION);

    // Configure UART
    uint8_t clock_setting = get_clock_setting();
    EUSCI_A_UART_initParam param = UartParams[clock_setting];

    if (STATUS_FAIL == EUSCI_A_UART_init(EUSCI_A0_BASE, &param))
        return;

    EUSCI_A_UART_enable(EUSCI_A0_BASE);

    EUSCI_A_UART_clearInterrupt(EUSCI_A0_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT);

    // Enable debug uart RX interrupt
    EUSCI_A_UART_enableInterrupt(EUSCI_A0_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT);

    // Select UART TXD on P2.0
    GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P2, GPIO_PIN0, GPIO_SECONDARY_MODULE_FUNCTION);
}
